demo/app/controllers/emails_controller.rb

SELECT "emails".* FROM "emails" WHERE "emails"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @email = Email.find(params[:id])

SELECT "emails".* FROM "emails" WHERE "emails"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @email = Email.find(params[:id])

INSERT INTO "emails" ("content", "created_at", "from_name", "from_user_id", "ps_id", "subject", "time_sent", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @email = Email.new(params[:email])

    respond_to do |format|
      if @email.save

SELECT "emails".* FROM "emails" WHERE "emails"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "emails" SET "subject" = 'Subject', "from_name" = 'Name', "updated_at" = '2012-09-02 00:00:19.726007', "ps_id" = 'Partner Site' WHERE "emails"."id" = 1
---
  def update
    @email = Email.find(params[:id])

    respond_to do |format|
      if @email.update_attributes(params[:email])